Core/src/src/Documents/СчетФактураОтправленныйГрузия/СчетФактураОтправленныйГрузия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураОтправленныйГрузия</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.АвансыОтправленныхФактур</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Корректировочная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаКорректировки</name>
    <type>
      <types>EnumRef.ПричиныКорректировкиСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеКорректировки</name>
    <type>
      <types>DocumentRef.СчетФактураОтправленныйГрузия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ЧекККМ</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.Взаимозачет</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПлатежа</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
        <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПодарок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ОтчетКомитенту</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyАналитикаКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/Enums/ВидыОперацийВзаимозачет/ВидыОперацийВзаимозачет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийВзаимозачет</name>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>ПереуступкаДолгаПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПереуступкаДолгаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаДолгаПокупателя</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаДолгаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПрочийВзаимозачет</name>
  </enumValues>
  <enumValues>
    <name>ЗачетДолгаПокупателяПерсонала</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Enums/ВидыОперацийПоступлениеВКассу/ВидыОперацийПоступлениеВКассу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступлениеВКассу</name>
  <enumValues>
    <name>ОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОтПодотчетника</name>
  </enumValues>
  <enumValues>
    <name>РозничнаяВыручка</name>
  </enumValues>
  <enumValues>
    <name>РозничнаяВыручкаСуммовойУчет</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВалюты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ВозвратЗаймаСотрудником</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеНаличныхВБанке</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Enums/ВидыОперацийПоступлениеНаСчет/ВидыОперацийПоступлениеНаСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступлениеНаСчет</name>
  <enumValues>
    <name>ОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОтПодотчетника</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВалюты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>Налоги</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ВозвратЗаймаСотрудником</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыПоКартам</name>
  </enumValues>
  <enumValues>
    <name>ВзносНаличными</name>
  </enumValues>
  <enumValues>
    <name>ПереводСДругогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ОтКурьерскойКомпанииПочты</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенегОтСотрудника</name>
  </enumValues>
  <enumValues>
    <name>AzRyОтПоставщикаОтПодотчетника</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Documents/СчетФактураОтправленныйГрузия/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	Если Объект.Ссылка.Пустая() Тогда
	//Paganini_ONESOFT-2337_
	Если ЗначениеЗаполнено(Параметры.Основание) И
		(ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ПоступлениеВКассу") ИЛИ
		 ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ПоступлениеНаСчет") ИЛИ
		 //++ONESOFT-4426
		 ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.РасходСоСчета")) Тогда   
		 //++ONESOFT-4426
		Объект.ВидНалога = НЕОПРЕДЕЛЕНО;
		Объект.СчетУчетаРегл = НЕОПРЕДЕЛЕНО;
		УстановитьАналитикуНалогаИзУчетнойПолитики();
	Иначе
	//_Paganini_ONESOFT-2337	
		Объект.Идентификатор			= 0;
		Объект.НомерСчетФактуры 		= "";
		Объект.Серия                    = "";
		Объект.НомерВходящегоДокумента 	= "";
		Объект.Статус					= Неопределено;
		Объект.ПериодРегистрации		= Дата(1,1,1);
		Для Каждого СтрокаТЧ ИЗ Объект.Запасы Цикл
			СтрокаТЧ.ID = 0;
		КонецЦикла;
		Объект.ДокументыПлатежа.Очистить();
		// Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
		Объект.ВидНалога = НЕОПРЕДЕЛЕНО;
		Объект.СчетУчетаРегл = НЕОПРЕДЕЛЕНО;
		// Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
		УстановитьАналитикуНалогаИзУчетнойПолитики(); //++lyskov 20.02.2023
	//Paganini_ONESOFT-2337_
	КонецЕсли;
	//_Paganini_ONESOFT-2337
	КонецЕсли;
	Контрагент = Объект.Контрагент;
	УстановитьВидимость();
	ОбщегоНазначенияПереопределяемый.УстановитьДополнительноеПоведениеСтандартныхКнопокТЧЗапасы(ЭтаФорма);// Kuzmich, 07.08.2019, Дополнительные инструменты в табличных частях документов движения товаров
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДатаВходящегоДокументаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПерепрочитатьФорму" Тогда
		Прочитать();      
	ИначеЕсли ИмяСобытия = "ЗаполнитьIDНоменклатур" Тогда	
		ЗаполнитьТзIDНоменклатур(); 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект)
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьИзДокументов(Команда)
	
	ЗаполнитьИзДокументовСервер();
	//Паганини#OneSoft_
	Если Объект.Корректировочная Тогда
		Объект.Запасы.Очистить();
		ЗаполнитьИзКорректировкиРеализации();
		ЗаполнитьИзПриходнаяНакладная();
	КонецЕсли;
	Модифицированность = Истина;
	//_Паганини#OneSoft   
	
	ЗаполнитьIDНоменклатур();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Объект.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", ВыбранноеЗначение)).Количество() > 1 Тогда
		Сообщить(НСтр("ka = 'ზედნადები უკვე შეყვანილია ანგარიშ-ფაქტურაში'; ru = 'ზედნადები უკვე შეყვანილია ანგარიშ-ფაქტურაში'; "));
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДокументыОснования.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументОснование) Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПолучитьИтоги(ТекущиеДанные.ДокументОснование));	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВходящегоДокументаПриИзменении(Элемент)
	
	ПриИзмененииПериодаРегистрации(ЭтаФорма, "ДатаВходящегоДокумента", "ОтображениеПериода");
	Если НЕ Элемент = Неопределено Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВходящегоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.ДатаВходящегоДокумента = Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.ДатаВходящегоДокумента));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	Если ДатаКалендаряНачало = Неопределено Тогда
		Объект.ДатаВходящегоДокумента = КонецДня(Объект.ДатаВходящегоДокумента);
	Иначе
		Объект.ДатаВходящегоДокумента = КонецДня(ДатаКалендаряНачало);
	КонецЕсли;
	
	ДатаВходящегоДокументаПриИзменении(Элемент);
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДатаВходящегоДокументаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ПриРегулированииПериодаРегистрации(ЭтаФорма, Направление, "ДатаВходящегоДокумента");
	ДатаВходящегоДокументаПриИзменении(Элемент);
	Модифицированность = Истина;
	
КонецПроцедуры





////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьИзДокументовСервер()
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрокаТЧ Из ЭтаФорма.Объект.ДокументыОснования Цикл
		//Паганини#OneSoft_
		Если ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			Продолжить;
		КонецЕсли;
		//_Паганини#OneSoft
		МассивДокументов.Добавить(СтрокаТЧ.ДокументОснование);	
	КонецЦикла;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьЗапасы(МассивДокументов);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИтоги(Документ)
	
	Структура = Новый Структура;
	//Паганини_
	//Структура.Вставить("Всего", ?(Не ТипЗнч(Документ) = Тип("ДокументСсылка.АктВыполненныхРабот"), Документ.Запасы.Итог("Всего"), Документ.РаботыИУслуги.Итог("Всего")));	
	//Структура.Вставить("СуммаНДС", ?(Не ТипЗнч(Документ) = Тип("ДокументСсылка.АктВыполненныхРабот"), Документ.Запасы.Итог("СуммаНДС"), Документ.РаботыИУслуги.Итог("СуммаНДС")));
	//Структура.Вставить("СуммаДокумента", Структура.Всего - Структура.СуммаНДС);
	Если НЕ (Документ.Курс = 1 ИЛИ Документ.Курс = 0) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПродажиОбороты.Регистратор,
			|	СУММА(ПродажиОбороты.СуммаОборот) КАК Всего,
			|	СУММА(ПродажиОбороты.СуммаНДСОборот) КАК СуммаНДС
			|ИЗ
			|	РегистрНакопления.Продажи.Обороты(, , Регистратор, Документ = &ДокументСсылка) КАК ПродажиОбороты
			|ГДЕ
			|	ПродажиОбороты.Регистратор = &ДокументСсылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ПродажиОбороты.Регистратор";
		Запрос.УстановитьПараметр("ДокументСсылка", Документ);
		ТЗПродажи = Запрос.Выполнить().Выгрузить();
		Если ТЗПродажи.Количество() = 0 Тогда
			Структура.Вставить("Всего",				0);
			Структура.Вставить("СуммаНДС",       	0);
			Структура.Вставить("СуммаДокумента", 	0);
		Иначе
			Структура.Вставить("Всего",				ТЗПродажи[0].Всего);
			Структура.Вставить("СуммаНДС",       	ТЗПродажи[0].СуммаНДС);
			Структура.Вставить("СуммаДокумента", 	ТЗПродажи[0].Всего - ТЗПродажи[0].СуммаНДС);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.Взаимозачет") Тогда	
		
		Структура.Вставить("Всего", 		Документ.СуммаРасчетов);																																							
		Структура.Вставить("СуммаНДС", 		0);
		Структура.Вставить("СуммаДокумента", Структура.Всего - Структура.СуммаНДС);
		
	//--------------------------------------------------------------------------
	// © Шишка В.В. [21 августа 2022]  НАЧАЛО
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда 
		Структура.Вставить("Всего", 		-(Документ.Запасы.Итог("Всего") + Документ.Расходы.Итог("Всего")));	
		Структура.Вставить("СуммаНДС", 		-(Документ.Запасы.Итог("СуммаНДС") + Документ.Расходы.Итог("СуммаНДС")));
		Структура.Вставить("СуммаДокумента", Структура.Всего  - Структура.СуммаНДС);
		
	// © Шишка В.В. [21 августа 2022]  КОНЕЦ
	//--------------------------------------------------------------------------
	Иначе
		Структура.Вставить("Всего", 		?(ТипЗнч(Документ) = Тип("ДокументСсылка.АктВыполненныхРабот"), Документ.РаботыИУслуги.Итог("Всего"), 		Документ.Запасы.Итог("Всего") +
																																						?(ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПокупателя"), Документ.Работы.Итог("Всего"), 	0)));	
		Структура.Вставить("СуммаНДС", 		?(ТипЗнч(Документ) = Тип("ДокументСсылка.АктВыполненныхРабот"), Документ.РаботыИУслуги.Итог("СуммаНДС"), 	Документ.Запасы.Итог("СуммаНДС") +
																																						?(ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПокупателя"), Документ.Работы.Итог("СуммаНДС"),	0)));
		Структура.Вставить("СуммаДокумента", Структура.Всего - Структура.СуммаНДС);
	КонецЕсли;//_Паганини
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииПериодаРегистрации(ПереданнаяФорма, ИмяРеквизита, ИмяОтображения)
    	
	ПереданнаяФорма.Объект[ИмяРеквизита] 	= НачалоМесяца(ПереданнаяФорма.Объект[ИмяРеквизита]);
	ПереданнаяФорма[ИмяОтображения] 		= Формат(ПереданнаяФорма.Объект[ИмяРеквизита], НСТР("ka=""Л=ka; ДФ='MMMM yyyy'"";ru=""ДФ='MMMM yyyy'"";en=""ДФ='MMMM yyyy'"""));
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриРегулированииПериодаРегистрации(ПереданнаяФорма, Направление, ИмяРеквизита) Экспорт
	
	ПереданнаяФорма.Объект[ИмяРеквизита] = ?(ЗначениеЗаполнено(ПереданнаяФорма.Объект[ИмяРеквизита]), 
						ДобавитьМесяц(ПереданнаяФорма.Объект[ИмяРеквизита], Направление),
						ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), Направление));
		
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Новый СписокЗначений; 
//Паганини#OneSoft_
Если Объект.Корректировочная Тогда
	СписокВыбора.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	СписокВыбора.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
Иначе
//_Паганини#OneSoft
	СписокВыбора.Добавить(Тип("ДокументСсылка.РасходнаяНакладная")); 
	//СписокВыбора.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная")); //Паганини#OneSoft
	СписокВыбора.Добавить(Тип("ДокументСсылка.АктВыполненныхРабот")); 
	СписокВыбора.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	СписокВыбора.Добавить(Тип("ДокументСсылка.Взаимозачет"));	
//Паганини#OneSoft_
КонецЕсли;
//_Паганини#OneSoft
	
	ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора);
	
	Если ВыбранноеЗначение <> Неопределено Тогда 
		Если ВыбранноеЗначение.Значение = Тип("ДокументСсылка.РасходнаяНакладная") Тогда 
			
			ЗначениеОтбора  = Новый Структура("ВидОперации", ПолучитьДанныеПеречисления("ВидыОперацийРасходнаяНакладная","ПродажаПокупателю"));
			ЗначениеОтбора.Вставить("Контрагент",Объект.Контрагент);
			пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);   
			Форма = ОткрытьФорму("Документ.РасходнаяНакладная.ФормаВыбора",пПараметрыВыбора,Элемент);
			
		ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда 
			
			ЗначениеОтбора  = Новый Структура("ВидОперации", ПолучитьДанныеПеречисления("ВидыОперацийПриходнаяНакладная","ВозвратОтПокупателя"));
			ЗначениеОтбора.Вставить("Контрагент",Объект.Контрагент);
			пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);   
			Форма = ОткрытьФорму("Документ.ПриходнаяНакладная.ФормаВыбора",пПараметрыВыбора,Элемент);
			
		ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда 
			//
			//ЗначениеОтбора  = Новый Структура("ВидОперации", ПолучитьДанныеПеречисления("ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию"));
			//ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора); 
			ЗначениеОтбора  = Новый Структура();
			ЗначениеОтбора.Вставить("Контрагент",Объект.Контрагент);
			пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
			Форма = ОткрытьФорму("Документ.АктВыполненныхРабот.ФормаВыбора",пПараметрыВыбора,Элемент);  
			
		ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.Взаимозачет") Тогда 
			//
			//ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора); 
			ЗначениеОтбора  = Новый Структура();
			ЗначениеОтбора.Вставить("Контрагент",Объект.Контрагент);
			ЗначениеОтбора.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя"));
			пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
			Форма = ОткрытьФорму("Документ.Взаимозачет.ФормаВыбора",пПараметрыВыбора,Элемент);	
			
		ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
			
			ЗначениеОтбора  = Новый Структура("ВидОперации", ПолучитьДанныеПеречисления("ВидыОперацийЗаказПокупателя","ЗаказНаряд"));
			ЗначениеОтбора.Вставить("Контрагент",Объект.Контрагент);
			пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);   
			Форма = ОткрытьФорму("Документ.ЗаказПокупателя.ФормаВыбора",пПараметрыВыбора,Элемент);
		//Паганини#OneSoft_
		ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.КорректировкаРеализации") Тогда 
			
			ЗначениеОтбора  = Новый Структура;
			ЗначениеОтбора.Вставить("Контрагент",Объект.Контрагент);
			пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);   
			Форма = ОткрытьФорму("Документ.КорректировкаРеализации.ФормаВыбора",пПараметрыВыбора,Элемент);
		//_Паганини#OneSoft
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция  ПолучитьДанныеПеречисления(ИмяПереч,ЗнчПереч)
	Возврат Перечисления[ИмяПереч][ЗнчПереч];
КонецФункции

Функция ПолучитьПараметрыФормыВыбора(Документ, Организация, Контрагент)
	
	СписокВидовДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(Документ);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтролироватьВыборДоговора", Контрагент.ВестиРасчетыПоДоговорам);
	ПараметрыФормы.Вставить("Контрагент", Контрагент);
	ПараметрыФормы.Вставить("Организация", Организация);
	//ПараметрыФормы.Вставить("ВидыДоговоров", СписокВидовДоговоров);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьРасходныеНакладные(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю"));
	ПараметрыОтбора.Вставить("Контрагент",	Объект.Контрагент);
	ПараметрыОтбора.Вставить("Проведен",	Истина);
	
	пПараметрыВыбора = Новый Структура;
	пПараметрыВыбора.Вставить("Отбор", 				ПараметрыОтбора);
	пПараметрыВыбора.Вставить("МножественныйВыбор",	Истина);
	
	Результат = ОткрытьФормуМодально("Документ.РасходнаяНакладная.Форма.ФормаВыбора", пПараметрыВыбора);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	ЗаполнитьДокументы(Результат); 
	ЗаполнитьIDНоменклатур();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаказНаряды(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд"));
	ПараметрыОтбора.Вставить("Контрагент",	Объект.Контрагент);
	ПараметрыОтбора.Вставить("Проведен",	Истина);
	
	пПараметрыВыбора = Новый Структура;
	пПараметрыВыбора.Вставить("Отбор", 				ПараметрыОтбора);
	пПараметрыВыбора.Вставить("МножественныйВыбор",	Истина);
	
	Результат = ОткрытьФормуМодально("Документ.ЗаказПокупателя.Форма.ФормаВыбора", пПараметрыВыбора);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	ЗаполнитьДокументы(Результат);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВозвраты(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя"));
	ПараметрыОтбора.Вставить("Контрагент",	Объект.Контрагент);
	ПараметрыОтбора.Вставить("Проведен",	Истина);
	
	пПараметрыВыбора = Новый Структура;
	пПараметрыВыбора.Вставить("Отбор", 				ПараметрыОтбора);
	пПараметрыВыбора.Вставить("МножественныйВыбор",	Истина);
	
	Результат = ОткрытьФормуМодально("Документ.ПриходнаяНакладная.Форма.ФормаВыбора", пПараметрыВыбора);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	//Паганини#OneSoft_
	//ЗаполнитьДокументы(Результат);
	ЗаполнитьИзПриходнаяНакладная(Результат);
	//_Паганини#OneSoft
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументы(ВыбранныеДокументы)
	Для Каждого Док ИЗ ВыбранныеДокументы Цикл
		Если Объект.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", Док)).Количество() = 0 Тогда
			НовСтрока = Объект.ДокументыОснования.Добавить();
			НовСтрока.ДокументОснование = Док;
			ЗаполнитьЗначенияСвойств(НовСтрока, ПолучитьИтоги(НовСтрока.ДокументОснование));
		Иначе
			Сообщить(Строка(Док) + " უკვე შეყვანილია ანგარიშ-ფაქტურაში");
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьИзДокументовСервер();
КонецПроцедуры

&НаКлиенте
Процедура АвансПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Если Объект.Аванс Тогда
		Элементы.ГруппаДокументыОснования.Видимость = Ложь;
		Элементы.ГруппаЗапасы.Видимость 			= Ложь;
		Элементы.Итоги.Видимость 					= Ложь;
		Элементы.ГруппаАвансы.Видимость 			= Истина;
		Элементы.ИтогиАванс.Видимость 				= Истина;
		// Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
		Объект.ВидНалога = НЕОПРЕДЕЛЕНО;
		Объект.СчетУчетаРегл = НЕОПРЕДЕЛЕНО;
		// Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
	Иначе
		Элементы.ГруппаДокументыОснования.Видимость = Истина;
		Элементы.ГруппаЗапасы.Видимость 			= Истина;
		Элементы.Итоги.Видимость 					= Истина;
		Элементы.ИтогиАванс.Видимость 				= Ложь;
		Элементы.ГруппаАвансы.Видимость 			= Ложь;
	КонецЕсли;
	
	Элементы.СчетНДС.Видимость = НЕ (Объект.Аванс); // Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
	//Паганини#OneSoft_
	УстановитьВидимостьПоЗначениюКорректировачная();
	//_Паганини#OneSoft
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансы(Команда)
	ЗаполнитьАвансыНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвансыНаСервере()
	
	ТаблицаАвансов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьТаблицуАвансов(Объект.Ссылка, "СчетФактураОтправленныйГрузия", Объект.ДатаВходящегоДокумента, Объект.Организация, Объект.Контрагент);
	Объект.ДокументыПлатежа.Загрузить(ТаблицаАвансов);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПлатежаДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Новый СписокЗначений; 
	СписокВыбора.Добавить(Тип("ДокументСсылка.ПоступлениеВКассу")); 
	СписокВыбора.Добавить(Тип("ДокументСсылка.ПоступлениеНаСчет")); 
	СписокВыбора.Добавить(Тип("ДокументСсылка.ОперацияПоПлатежнымКартам")); 
	СписокВыбора.Добавить(Тип("ДокументСсылка.Взаимозачет"));
	
	ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора);
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗначениеОтбора  = Новый Структура;
	Если ВыбранноеЗначение.Значение = Тип("ДокументСсылка.ПоступлениеВКассу") Тогда 
		
		ИмяДокумента = "ПоступлениеВКассу";
		ЗначениеОтбора.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтПокупателя"));
		ЗначениеОтбора.Вставить("Контрагент",	Объект.Контрагент);
		
	ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда 
		
		ИмяДокумента = "ПоступлениеНаСчет";
		ЗначениеОтбора.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя"));
		ЗначениеОтбора.Вставить("Контрагент",	Объект.Контрагент);
		
	ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.ОперацияПоПлатежнымКартам") Тогда 
		 
		ИмяДокумента = "ОперацияПоПлатежнымКартам";
		ЗначениеОтбора.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийЭквайринга.ПоступлениеОплатыОтПокупателя"));
		ЗначениеОтбора.Вставить("Контрагент",	Объект.Контрагент);
		
	ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.Взаимозачет") Тогда 
		 
		ИмяДокумента = "ОперацияПоПлатежнымКартам";
		ЗначениеОтбора.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя"));
		ЗначениеОтбора.Вставить("Контрагент",	Объект.Контрагент);
		
	КонецЕсли;
	
	ЗначениеОтбора.Вставить("Проведен", Истина);
	пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);   
	Форма = ОткрытьФорму("Документ." +ИмяДокумента+".ФормаВыбора",пПараметрыВыбора,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПлатежаДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЗаполнитьДанныеДокументаАванса(ВыбранноеЗначение, Элементы.ДокументыПлатежа.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДокументаАванса(Документ, ИД)
	
	РасчетыСПокупателями = Документ.Получитьобъект().Движения.РасчетыСПокупателями;
	РасчетыСПокупателями.Прочитать();
	ЕстьСтрокиАвансов	= Ложь;
	ПерваяСтрока		= Истина;
	Для Каждого СтрокаДвижения Из РасчетыСПокупателями Цикл
		Если СтрокаДвижения.ТипРасчетов = Перечисления.ТипыРасчетов.Аванс Тогда
			Если ПерваяСтрока Тогда
				НовСтрока = Объект.ДокументыПлатежа.НайтиПоИдентификатору(ИД);
				ПерваяСтрока = Ложь;
			Иначе
				НовСтрока = Объект.ДокументыПлатежа.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаДвижения);
			НовСтрока.СуммаНДС = Окр(СтрокаДвижения.Сумма * 18/118, 2);
			ЕстьСтрокиАвансов	= Истина;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЕстьСтрокиАвансов Тогда
		ТекСтрока = Объект.ДокументыПлатежа.НайтиПоИдентификатору(ИД);
		ТекСтрока.Сумма		= 0;
		ТекСтрока.СуммаНДС	= 0;
		ТекСтрока.Договор	= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПлатежаДокументПриИзменении(Элемент)
	ТекСтрока = Элементы.ДокументыПлатежа.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекСтрока.Документ) Тогда
		ТекСтрока.Сумма		= 0;
		ТекСтрока.СуммаНДС	= 0;
		ТекСтрока.Договор	= Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьАвансы(Команда)
	СтруктураАдреса = ПолучитьАдресТаблицыОстатков();
	Результат = ОткрытьФормуМодально("Документ.СчетФактураОтправленныйГрузия.Форма.ФормаОстаткиАвансов", СтруктураАдреса);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьВыделенныеСтроки(Результат.АдресТаблицы);
	Модифицированность = Истина;
КонецПроцедуры

Процедура ЗаполнитьВыделенныеСтроки(АдресТаблицы)
	ВыделенныеСтроки = ПолучитьИзВременногоХранилища(АдресТаблицы);
	Для Каждого СтрокаТЧ ИЗ ВыделенныеСтроки Цикл
		НовСтрока = Объект.ДокументыПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицыОстатков()
	ТаблицаАвансов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьТаблицуАвансов(Объект.Ссылка, "СчетФактураОтправленныйГрузия", Объект.ДатаВходящегоДокумента, Объект.Организация, Объект.Контрагент, Объект.ДокументыПлатежа);
	Возврат Новый Структура("АдресТаблицы", ПоместитьВоВременноеХранилище(ТаблицаАвансов));
КонецФункции

&НаКлиенте
Процедура ДокументыПлатежаСуммаПриИзменении(Элемент)
	ТекДанные = Элементы.ДокументыПлатежа.ТекущиеДанные;
	ТекДанные.СуммаНДС = Окр(ТекДанные.Сумма * 18/118, 2);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПередИзменением = Контрагент;
	Контрагент = Объект.Контрагент;
	
	Если КонтрагентПередИзменением <> Объект.Контрагент Тогда
		Если Объект.ДокументыПлатежа.Количество() > 0 Тогда
			ПараметрыДокумента = Новый Структура;
			ПараметрыДокумента.Вставить("КонтрагентПередИзменением", КонтрагентПередИзменением);
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОбОчисткеДокументовПлатежаЗавершение", ЭтотОбъект, ПараметрыДокумента);
			ТекстВопроса = НСтр("ka='გადახდის დოკუმენტები გაიწმინდება, გავაგრძელოთ?';ru='Документы платежа будет очищен, продолжить?';en='payment documents will be cleared to continue?'");
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОбОчисткеДокументовПлатежаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ДокументыПлатежа.Очистить();
	Иначе
		Объект.Контрагент	= ДополнительныеПараметры.КонтрагентПередИзменением;
		Контрагент			= ДополнительныеПараметры.КонтрагентПередИзменением;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини   
	//ПроверитьIDНоменклатур();
КонецПроцедуры

// Kuzmich, 15.09.2019, Добавление бух проводок в счет фактурах
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьАналитикуНалогаИзУчетнойПолитики();
КонецПроцедуры

&НаСервере
Процедура УстановитьАналитикуНалогаИзУчетнойПолитики()
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ДатаСведений = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
		
		//Объект.ВидНалога = РегистрыСведений.УчетнаяПолитикаРегл.ЗначениеПоляУчетнойПолитики(
		//	"СчетФактураВыданныйВидНалогаПриСинхронизации",
		//	Объект.Организация,
		//	ДатаСведений);
		//
		//Объект.СчетУчетаРегл = РегистрыСведений.УчетнаяПолитикаРегл.ЗначениеПоляУчетнойПолитики(
		//	"СчетФактураВыданныйСчетУчетаПриСинхронизации",
		//	Объект.Организация,
		//	ДатаСведений);
		
		// Олег Литвиненко 06.07.23 --->
		ЗначенияУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаРегл.ЗначенияПолейУчетнойПолитики(
			"СчетФактураВыданныйВидНалогаПриСинхронизации,СчетФактураВыданныйСчетУчетаПриСинхронизации,ЗаполнятьСчетаВСчетахФактуры",
			Объект.Организация,
			ДатаСведений
		);
		
		Объект.ВидНалога = ЗначенияУчетнойПолитики.СчетФактураВыданныйВидНалогаПриСинхронизации;
		
		Если ЗначенияУчетнойПолитики.ЗаполнятьСчетаВСчетахФактуры Тогда
			Объект.СчетУчетаРегл = ЗначенияУчетнойПолитики.СчетФактураВыданныйСчетУчетаПриСинхронизации;
		КонецЕсли;
		
		// Олег Литвиненко <---
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНалогаПриИзменении(Элемент)
	
	УстановитьСчетУчетаРеглИзВидаНалога();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСчетУчетаРеглИзВидаНалога()
	
	Если ЗначениеЗаполнено(Объект.ВидНалога) Тогда
		Объект.СчетУчетаРегл = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидНалога, "СчетУчетаРегл");
	КонецЕсли;
	
КонецПроцедуры
// Kuzmich, 15.09.2019, Добавление бух проводок в счет фактурах

//Паганини_
&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.Запасы.ТекущиеДанные;
	ТекДанные.ЕдиницаИзмерения 	= ПолучитьЗначенияРеквизита(ТекДанные.Номенклатура, "ЕдиницаИзмерения");
	ТекДанные.СтавкаНДС 		= ПолучитьЗначенияРеквизита(ТекДанные.Номенклатура, "СтавкаНДС");
	ПересчитатьСуммы(ТекДанные.ПолучитьИдентификатор(), "Сумма_СтавкаНДС");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияРеквизита(Ссылка, ИмяРеквизита)
	Возврат Ссылка[ИмяРеквизита];
КонецФункции


&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Запасы.ТекущаяСтрока;
	ПересчитатьСуммы(ТекущаяСтрока, "Количество_Цена");
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Запасы.ТекущаяСтрока;
	ПересчитатьСуммы(ТекущаяСтрока, "Количество_Цена");
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСтавкаНДСПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Запасы.ТекущаяСтрока;
	ПересчитатьСуммы(ТекущаяСтрока, "Сумма_СтавкаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Запасы.ТекущаяСтрока;
	ПересчитатьСуммы(ТекущаяСтрока, "Сумма_СтавкаНДС");
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыСуммаНДСПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Запасы.ТекущаяСтрока;
	ПересчитатьСуммы(ТекущаяСтрока, "СуммаНДС");
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммы(Идентификатор, ИмяКолонки)
	
	СтрокаТЧ = Объект.Запасы.НайтиПоИдентификатору(Идентификатор);
	СтавкаНДС = СтрокаТЧ.СтавкаНДС.Ставка;
	
	Если ИмяКолонки = "Количество_Цена" Тогда
		СтрокаТЧ.Всего		= СтрокаТЧ.Цена			* СтрокаТЧ.Количество;
		СтрокаТЧ.СуммаНДС	= Окр(СтрокаТЧ.Всего	* СтавкаНДС/(100+СтавкаНДС), 2);
		СтрокаТЧ.Сумма 		= СтрокаТЧ.Всего - СтрокаТЧ.СуммаНДС;
	ИначеЕсли ИмяКолонки = "Сумма_СтавкаНДС" Тогда
		СтрокаТЧ.СуммаНДС	= Окр(СтрокаТЧ.Сумма	* СтавкаНДС/100, 2);
		СтрокаТЧ.Всего		= СтрокаТЧ.СуммаНДС + СтрокаТЧ.Сумма;
	ИначеЕсли ИмяКолонки = "СуммаНДС" Тогда
		СтрокаТЧ.Сумма		= СтрокаТЧ.Всего	- СтрокаТЧ.СуммаНДС;
	КонецЕсли;

КонецПроцедуры




//_Паганини

//Паганини#OneSoft_
&НаКлиенте
Процедура КорректировочнаяПриИзменении(Элемент)
	УстановитьВидимостьПоЗначениюКорректировачная(Истина)
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКорректировкиРеализации(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Контрагент",	Объект.Контрагент);
	ПараметрыОтбора.Вставить("Проведен",	Истина);
	
	пПараметрыВыбора = Новый Структура;
	пПараметрыВыбора.Вставить("Отбор", 				ПараметрыОтбора);
	пПараметрыВыбора.Вставить("МножественныйВыбор",	Истина);
	
	ВыбранныеДокументы = ОткрытьФормуМодально("Документ.КорректировкаРеализации.Форма.ФормаВыбора", пПараметрыВыбора);
	Если ВыбранныеДокументы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	ЗаполнитьИзКорректировкиРеализации(ВыбранныеДокументы);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзКорректировкиРеализации(ВыбранныеДокументы = Неопределено)

	Если ВыбранныеДокументы = Неопределено Тогда
		ВыбранныеДокументы = Новый Массив;
		Для Каждого СтрокаТЧ Из Объект.ДокументыОснования Цикл
			Если ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				ВыбранныеДокументы.Добавить(СтрокаТЧ.ДокументОснование);
			КонецЕсли;
		КонецЦикла;
		Если ВыбранныеДокументы.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Для Каждого Док ИЗ ВыбранныеДокументы Цикл
			Если Объект.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", Док)).Количество() = 0 Тогда
				НовСтрока = Объект.ДокументыОснования.Добавить();
				НовСтрока.ДокументОснование = Док;
				ЗаполнитьЗначенияСвойств(НовСтрока, ПолучитьИтоги(НовСтрока.ДокументОснование));
			Иначе
				Сообщить(Строка(Док) + " უკვე შეყვანილია ანგარიშ-ფაქტურაში");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьИзКорректировкиРеализации(ВыбранныеДокументы);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзПриходнаяНакладная(ВыбранныеДокументы = Неопределено)

	Если ВыбранныеДокументы = Неопределено Тогда
		ВыбранныеДокументы = Новый Массив;
		Для Каждого СтрокаТЧ Из Объект.ДокументыОснования Цикл
			Если ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
				ВыбранныеДокументы.Добавить(СтрокаТЧ.ДокументОснование);
			КонецЕсли;
		КонецЦикла;
		Если ВыбранныеДокументы.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Для Каждого Док ИЗ ВыбранныеДокументы Цикл
			Если Объект.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", Док)).Количество() = 0 Тогда
				НовСтрока = Объект.ДокументыОснования.Добавить();
				НовСтрока.ДокументОснование = Док;
				ЗаполнитьЗначенияСвойств(НовСтрока, ПолучитьИтоги(НовСтрока.ДокументОснование));
			Иначе
				Сообщить(Строка(Док) + " უკვე შეყვანილია ანგარიშ-ფაქტურაში");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьИзПриходнаяНакладная(ВыбранныеДокументы);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоЗначениюКорректировачная(ОчиститьЕслиНеСоответствует = Ложь)
	
	Элементы.РеквизитыКорректировочнойФактуры.Видимость						= Объект.Корректировочная;
	Элементы.ДокументыОснованияДобавитьВозвраты.Видимость					= Объект.Корректировочная;
	Элементы.ДокументыОснованияДобавитьКорректировкиРеализации.Видимость	= Объект.Корректировочная;
	
	Элементы.ДокументыОснованияДобавитьРасходныеНакладные.Видимость = НЕ Объект.Корректировочная;
	Элементы.ДокументыОснованияДобавитьЗаказНаряды.Видимость 		= НЕ Объект.Корректировочная;
	
	Если ОчиститьЕслиНеСоответствует Тогда
		Если Объект.Корректировочная Тогда
			Для Каждого СтрокаТЧ ИЗ Объект.ДокументыОснования Цикл
				Если НЕ ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") И 
					 НЕ ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
					СтрокаТЧ.ДокументОснование = Неопределено;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого СтрокаТЧ ИЗ Объект.ДокументыОснования Цикл
				Если ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") ИЛИ
					 ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
					СтрокаТЧ.ДокументОснование = Неопределено;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеКорректировкиПриИзменении(Элемент)
	Объект.Запасы.Очистить();
	ЗаполнитьИзКорректировкиРеализации();
	ЗаполнитьИзПриходнаяНакладная();
КонецПроцедуры



//_Паганини#OneSoft
//--------------------------------------------------------------------------
// © Шишка В.В. [11 августа 2022]  НАЧАЛО
&НаСервере
Процедура ДокументыОснованияПослеУдаленияНаСервере()
	МассивДокументов = Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование");
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьЗапасы(МассивДокументов);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПослеУдаления(Элемент) 
	ДокументыОснованияПослеУдаленияНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПриходнаяНакрадная(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя"));
	ПараметрыОтбора.Вставить("Контрагент",	Объект.Контрагент);
	ПараметрыОтбора.Вставить("Проведен",	Истина);
	
	пПараметрыВыбора = Новый Структура;
	пПараметрыВыбора.Вставить("Отбор", 				ПараметрыОтбора);
	пПараметрыВыбора.Вставить("МножественныйВыбор",	Истина);
	
	Результат = ОткрытьФормуМодально("Документ.ПриходнаяНакладная.Форма.ФормаВыбора", пПараметрыВыбора);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	ЗаполнитьДокументы(Результат);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.ДатаИзмененаПользователем = Истина;
	
КонецПроцедуры

// © Шишка В.В. [11 августа 2022]  КОНЕЦ
//--------------------------------------------------------------------------
&НаСервере
Процедура ЗаполнитьТзIDНоменклатур()   
	
	ДокОбъект = Объект.Ссылка.ПолучитьОбъект(); 
	Если Объект.IDНоменклатур.Количество() = 0 Тогда  		    
		ДокОбъект.IDНоменклатур.Загрузить(Объект.Запасы.Выгрузить());
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);	
	Иначе 
		Для Каждого Ст Из Объект.Запасы Цикл 
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", Ст.Номенклатура);  
			ПараметрыОтбора.Вставить("ЕдиницаИзмерения", Ст.ЕдиницаИзмерения);		
			
		    ДанныеID = Объект.IDНоменклатур.НайтиСтроки(ПараметрыОтбора);
			
			Если ДанныеID.количество() > 0 Тогда 
				Продолжить;
			Иначе 			
				НовСтр = ДокОбъект.IDНоменклатур.Добавить();
				НовСтр.Номенклатура = Ст.Номенклатура;  
				НовСтр.ЕдиницаИзмерения = Ст.ЕдиницаИзмерения;
                НовСтр.ID = Ст.ID;		
			КонецЕсли;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьIDНоменклатур()
	
	Для Каждого Ст из Объект.Запасы Цикл  
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", Ст.Номенклатура);  
		ПараметрыОтбора.Вставить("ЕдиницаИзмерения", Ст.ЕдиницаИзмерения);		
		
		ДанныеID = Объект.IDНоменклатур.НайтиСтроки(ПараметрыОтбора);  
		
		Если ДанныеID.количество() > 0 Тогда 			
			Ст.ID = ДанныеID[0].ID;	
		КонецЕсли;
	
	КонецЦикла; 
		
	
КонецПроцедуры   




//&НаСервере
//Процедура ПроверитьIDНоменклатур()   
//	

//	
//КонецПроцедуры 


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДокОбъект = Объект.Ссылка.ПолучитьОбъект();
	Для Каждого Ст из Объект.IDНоменклатур Цикл  
		
		Тз = Новый ТаблицаЗначений;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", Ст.Номенклатура);  
		ПараметрыОтбора.Вставить("ЕдиницаИзмерения", Ст.ЕдиницаИзмерения);		
		
		ДанныеID = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);  
		      
		Если ДанныеID.количество() = 0 Тогда 					
			ДокОбъект.IDНоменклатур.Удалить(Объект.IDНоменклатур.Индекс(Ст));
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		КонецЕсли;
	
	КонецЦикла;


КонецПроцедуры
